## Homework 1

In [1]:
import pandas as pd
import pyarrow as pa
import pyarrow.parquet as pq

### Question 1. What's the version of pip in the python:3.13 image? (1 point)
- 25.3
- 24.3.1
- 24.2.1
- 23.3.1

docker run -it --entrypoint=bash --rm python:3.13

![alt text](img1.png)

In [2]:
# 25.3

### Question 2. Given the docker-compose.yaml, what is the hostname and port that pgadmin should use to connect to the postgres database? (1 point)
- postgres:5433
- localhost:5432
- db:5433
- postgres:5432
- db:5432

In [3]:
# db:5432

### Question 3. For the trips in November 2025 (lpep_pickup_datetime between '2025-11-01' and '2025-12-01', exclusive of the upper bound), how many trips had a trip_distance of less than or equal to 1 mile? (1 point)
- 7,853
- 8,007
- 8,254
- 8,421

In [4]:
df1 = pq.read_table('green_tripdata_2025-11.parquet').to_pandas()
df1.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,...,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge,cbd_congestion_fee
0,2,2025-11-01 00:34:48,2025-11-01 00:41:39,N,1.0,74,42,1.0,0.74,7.2,...,0.5,1.94,0.0,NaN,1.0,11.64,1.0,1.0,0.00,0.0
1,2,2025-11-01 00:18:52,2025-11-01 00:24:27,N,1.0,74,42,2.0,0.95,7.2,...,0.5,0.00,0.0,NaN,1.0,9.70,2.0,1.0,0.00,0.0
2,2,2025-11-01 01:03:14,2025-11-01 01:15:24,N,1.0,83,160,1.0,2.19,13.5,...,0.5,5.00,0.0,NaN,1.0,21.00,1.0,1.0,0.00,0.0
3,2,2025-11-01 00:10:57,2025-11-01 00:24:53,N,1.0,166,127,1.0,5.44,24.7,...,0.5,0.50,0.0,NaN,1.0,27.70,1.0,1.0,0.00,0.0
4,1,2025-11-01 00:03:48,2025-11-01 00:19:38,N,1.0,166,262,1.0,3.20,18.4,...,1.5,1.00,0.0,NaN,1.0,24.65,1.0,1.0,2.75,0.0

In [5]:
len(df1)

46912

In [6]:
df2 = pd.read_csv('taxi_zone_lookup.csv')
df2.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [7]:
len(df2)

265

In [8]:
len(df1[(df1['lpep_pickup_datetime']<'2025-12-01')
    & (df1['lpep_pickup_datetime']>='2025-11-01')
    & (df1['trip_distance'] <= 1)])

8007

### Question 4. Which was the pick up day with the longest trip distance? Only consider trips with trip_distance less than 100 miles. (1 point)
- 2025-11-14
- 2025-11-20
- 2025-11-23
- 2025-11-25

In [9]:
df3 = df1[df1['trip_distance']<100][['trip_distance','lpep_pickup_datetime']]
longest_trip_dist = max(df3['trip_distance'])
df3[df3['trip_distance']==longest_trip_dist]['lpep_pickup_datetime']

18867   2025-11-14 15:36:27
Name: lpep_pickup_datetime, dtype: datetime64[us]

In [10]:
# 2025-11-14

### Question 5. Which was the pickup zone with the largest total_amount (sum of all trips) on November 18th, 2025? (1 point)
- East Harlem North
- East Harlem South
- Morningside Heights
- Forest Hills

In [11]:
df1.columns

Index(['VendorID', 'lpep_pickup_datetime', 'lpep_dropoff_datetime',
       'store_and_fwd_flag', 'RatecodeID', 'PULocationID', 'DOLocationID',
       'passenger_count', 'trip_distance', 'fare_amount', 'extra', 'mta_tax',
       'tip_amount', 'tolls_amount', 'ehail_fee', 'improvement_surcharge',
       'total_amount', 'payment_type', 'trip_type', 'congestion_surcharge',
       'cbd_congestion_fee'],
      dtype='str')

In [12]:
df1[(df1['lpep_pickup_datetime'] >= '2025-11-18') & (df1['lpep_pickup_datetime'] < '2025-11-19')][['PULocationID','total_amount']].sort_values(by='total_amount',ascending=False)

       PULocationID  total_amount
25233            92        351.00
25234            92        351.00
24956            82        156.55
24640            65        147.81
25200            93        133.20
...             ...           ...
23890           244          0.00
24140           243          0.00
24739           244         -1.20
23774            74         -4.50
24923            34         -7.00

[1773 rows x 2 columns]

In [13]:
df2[df2['LocationID'] == 92]

    LocationID Borough      Zone service_zone
91          92  Queens  Flushing    Boro Zone

In [14]:
df1[(df1['lpep_pickup_datetime'] >= '2025-11-18') & (df1['lpep_pickup_datetime'] < '2025-11-19')].groupby('PULocationID')['total_amount'].sum().sort_values(ascending=False)

PULocationID
74     9281.92
75     6696.13
43     2378.79
244    2139.05
166    2100.59
        ...
77       16.00
249      16.00
151      16.00
32       13.57
34        0.00
Name: total_amount, Length: 137, dtype: float64

In [15]:
df2[df2['LocationID'] == 74]

    LocationID    Borough               Zone service_zone
73          74  Manhattan  East Harlem North    Boro Zone

In [16]:
# East Harlem North

### Question 6. For the passengers picked up in the zone named "East Harlem North" in November 2025, which was the drop off zone that had the largest tip? (1 point)
- JFK Airport
- Yorkville West
- East Harlem North
- LaGuardia Airport

In [17]:
df5 = df1[(df1['PULocationID'] == 74) & (df1['lpep_pickup_datetime'] >= '2025-11-01') & (df1['lpep_pickup_datetime'] < '2025-12-01')][['tip_amount', 'DOLocationID']]

In [18]:
df5.sort_values(by='tip_amount', ascending=False)

       tip_amount  DOLocationID
40883       81.89           263
31744       50.00           138
38851       45.00            74
32603       34.25           146
20175       28.90           265
...           ...           ...
24916        0.00           116
37288        0.00           116
24931        0.00            74
14826        0.00           152
15211        0.00            74

[12041 rows x 2 columns]

In [19]:
df2[df2['LocationID'] == 263]

     LocationID    Borough            Zone service_zone
262         263  Manhattan  Yorkville West  Yellow Zone

In [20]:
# Yorkville West

### Question 7. Which of the following sequences describes the Terraform workflow for: 
    1) Downloading plugins and setting up backend,
    2) Generating and executing changes,
    3) Removing all resources? (1 point)
- terraform import, terraform apply -y, terraform destroy
- teraform init, terraform plan -auto-apply, terraform rm
- terraform init, terraform run -auto-approve, terraform destroy
- terraform init, terraform apply -auto-approve, terraform destroy
- terraform import, terraform apply -y, terraform rm

In [21]:
# teraform init, terraform apply -auto-approve, terraform destroy